modm-ext/data.modm.io/docs/svd/header_stm32wb35xx.svd
        <register>
          <name>SWPR2</name>
          <description>SYSCFG write protection register part 2</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PAGE32</name>
              <description>SRAM2B Write protection page 0 (0x20038000 - 0x200383FF)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE33</name>
              <description>SRAM2B Write protection page 1 (0x20038400 - 0x200387FF)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE34</name>
              <description>SRAM2B Write protection page 2 (0x20038800 - 0x20038bFF)</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE35</name>
              <description>SRAM2B Write protection page 3 (0x20038C00 - 0x20038FFF)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE36</name>
              <description>SRAM2B Write protection page 4 (0x20039000 - 0x200393FF)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE37</name>
              <description>SRAM2B Write protection page 5 (0x20039400 - 0x200397FF)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE38</name>
              <description>SRAM2B Write protection page 6 (0x20039800 - 0x20039BFF)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE39</name>
              <description>SRAM2B Write protection page 7 (0x20039C00 - 0x20039FFF)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE40</name>
              <description>SRAM2B Write protection page 8 (0x2003A000 - 0x2003A3FF)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE41</name>
              <description>SRAM2B Write protection page 9 (0x2003A400 - 0x2003A7FF)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE42</name>
              <description>SRAM2B Write protection page 10 (0x2003A800 - 0x2003ABFF)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE43</name>
              <description>SRAM2B Write protection page 11 (0x2003AC00 - 0x2003AFFF)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE44</name>
              <description>SRAM2B Write protection page 12 (0x2003B000 - 0x2003B3FF)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE45</name>
              <description>SRAM2B Write protection page 13 (0x2003B400 - 0x2003B7FF)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE46</name>
              <description>SRAM2B Write protection page 14 (0x2003B800 - 0x2003BBFF)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE47</name>
              <description>SRAM2B Write protection page 15 (0x2003BC00 - 0x2003BFFF)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE48</name>
              <description>SRAM2B Write protection page 16 (0x2003C000 - 0x2003C3FF)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE49</name>
              <description>SRAM2B Write protection page 17 (0x2003C400 - 0x2003C7FF)</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE50</name>
              <description>SRAM2B Write protection page 18 (0x2003C800 - 0x2003CBFF)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE51</name>
              <description>SRAM2B Write protection page 19 (0x2003CC00 - 0x2003CFFF)</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE52</name>
              <description>SRAM2B Write protection page 20 (0x2003D000 - 0x2003D3FF)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE53</name>
              <description>SRAM2B Write protection page 21 (0x2003D400 - 0x2003D7FF)</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE54</name>
              <description>SRAM2B Write protection page 22 (0x2003D800 - 0x2003DBFF)</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE55</name>
              <description>SRAM2B Write protection page 23 (0x2003DC00 - 0x2003DFFF)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE56</name>
              <description>SRAM2B Write protection page 24 (0x2003E000 - 0x2003E3FF)</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE57</name>
              <description>SRAM2B Write protection page 25 (0x2003E400 - 0x2003E7FF)</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE58</name>
              <description>SRAM2B Write protection page 26 (0x2003E800 - 0x2003EBFF)</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE59</name>
              <description>SRAM2B Write protection page 27 (0x2003EC00 - 0x2003EFFF)</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE60</name>
              <description>SRAM2B Write protection page 28 (0x2003F000 - 0x2003F3FF)</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE61</name>
              <description>SRAM2B Write protection page 29 (0x2003F400 - 0x2003F7FF)</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE62</name>
              <description>SRAM2B Write protection page 30 (0x2003F800 - 0x2003FBFF)</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PAGE63</name>
              <description>SRAM2B Write protection page 31 (0x2003FC00 - 0x2003FFFF)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR1</name>
          <description>SYSCFG CPU1 (CORTEX M4) interrupt masks control-status register part 1</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>TIM1IM</name>
              <description>Enabling of interrupt from Timer 1 to CPU1</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM16IM</name>
              <description>Enabling of interrupt from Timer 16 to CPU1</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>TIM17IM</name>
              <description>Enabling of interrupt from Timer 17 to CPU1</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5IM</name>
              <description>Enabling of interrupt from External Interrupt Line 5 to CPU1</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6IM</name>
              <description>Enabling of interrupt from External Interrupt Line 6 to CPU1</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7IM</name>
              <description>Enabling of interrupt from External Interrupt Line 7 to CPU1</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8IM</name>
              <description>Enabling of interrupt from External Interrupt Line 8 to CPU1</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9IM</name>
              <description>Enabling of interrupt from External Interrupt Line 9 to CPU1</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10IM</name>
              <description>Enabling of interrupt from External Interrupt Line 10 to CPU1</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11IM</name>
              <description>Enabling of interrupt from External Interrupt Line 11 to CPU1</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12IM</name>
              <description>Enabling of interrupt from External Interrupt Line 12 to CPU1</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13IM</name>
              <description>Enabling of interrupt from External Interrupt Line 13 to CPU1</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14IM</name>
              <description>Enabling of interrupt from External Interrupt Line 14 to CPU1</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI15IM</name>
              <description>Enabling of interrupt from External Interrupt Line 15 to CPU1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR2</name>
          <description>SYSCFG CPU1 (CORTEX M4) interrupt masks control-status register part 2</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>PVM1IM</name>
              <description>Enabling of interrupt from Power Voltage Monitoring 1 to CPU1</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVM3IM</name>
              <description>Enabling of interrupt from Power Voltage Monitoring 3 to CPU1</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PVDIM</name>
              <description>Enabling of interrupt from Power Voltage Detector to CPU1</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2IMR1</name>
          <description>SYSCFG CPU2 (CORTEX M0) interrupt masks control-status register part 1</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>RTCSTAMPTAMPLSECSSIM</name>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCWKUPIM</name>
              <description>Enabling of interrupt from RTC Wakeup to CPU2</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RTCALARMIM</name>
              <description>Enabling of interrupt from RTC Alarms to CPU2</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RCCIM</name>
              <description>Enabling of interrupt from RCC to CPU2</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>FLASHIM</name>
              <description>Enabling of interrupt from FLASH to CPU2</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>PKAIM</name>
              <description>Enabling of interrupt from Public Key Accelerator to CPU2</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>RNGIM</name>
              <description>Enabling of interrupt from Random Number Generator to CPU2</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>AES1IM</name>
              <description>Enabling of interrupt from Advanced Encryption Standard 1 to CPU2</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>COMPIM</name>
              <description>Enabling of interrupt from Comparator to CPU2</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ADCIM</name>
              <description>Enabling of interrupt from Analog Digital Converter to CPU2</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI0IM</name>
              <description>Enabling of interrupt from External Interrupt Line 0 to CPU2</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI1IM</name>
              <description>Enabling of interrupt from External Interrupt Line 1 to CPU2</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI2IM</name>
              <description>Enabling of interrupt from External Interrupt Line 2 to CPU2</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI3IM</name>
              <description>Enabling of interrupt from External Interrupt Line 3 to CPU2</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI4IM</name>
              <description>Enabling of interrupt from External Interrupt Line 4 to CPU2</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI5IM</name>
              <description>Enabling of interrupt from External Interrupt Line 5 to CPU2</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI6IM</name>
              <description>Enabling of interrupt from External Interrupt Line 6 to CPU2</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI7IM</name>
              <description>Enabling of interrupt from External Interrupt Line 7 to CPU2</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI8IM</name>
              <description>Enabling of interrupt from External Interrupt Line 8 to CPU2</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI9IM</name>
              <description>Enabling of interrupt from External Interrupt Line 9 to CPU2</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI10IM</name>
              <description>Enabling of interrupt from External Interrupt Line 10 to CPU2</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI11IM</name>
              <description>Enabling of interrupt from External Interrupt Line 11 to CPU2</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI12IM</name>
              <description>Enabling of interrupt from External Interrupt Line 12 to CPU2</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI13IM</name>
              <description>Enabling of interrupt from External Interrupt Line 13 to CPU2</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI14IM</name>
              <description>Enabling of interrupt from External Interrupt Line 14 to CPU2</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>EXTI15IM</name>
              <description>Enabling of interrupt from External Interrupt Line 15 to CPU2</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
