modm-ext/data.modm.io/docs/svd/header_stm32wb35xx.svd
        <register>
          <name>C2ICR</name>
          <description>HSEM CPU2 interrupt clear register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISC0</name>
              <description>semaphore 0 CPU2 interrupt clear bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC1</name>
              <description>semaphore 1 CPU2 interrupt clear bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC2</name>
              <description>semaphore 2 CPU2 interrupt clear bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC3</name>
              <description>semaphore 3 CPU2 interrupt clear bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC4</name>
              <description>semaphore 4 CPU2 interrupt clear bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC5</name>
              <description>semaphore 5 CPU2 interrupt clear bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC6</name>
              <description>semaphore 6 CPU2 interrupt clear bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC7</name>
              <description>semaphore 7 CPU2 interrupt clear bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC8</name>
              <description>semaphore 8 CPU2 interrupt clear bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC9</name>
              <description>semaphore 9 CPU2 interrupt clear bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC10</name>
              <description>semaphore 10 CPU2 interrupt clear bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC11</name>
              <description>semaphore 11 CPU2 interrupt clear bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC12</name>
              <description>semaphore 12 CPU2 interrupt clear bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC13</name>
              <description>semaphore 13 CPU2 interrupt clear bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC14</name>
              <description>semaphore 14 CPU2 interrupt clear bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC15</name>
              <description>semaphore 15 CPU2 interrupt clear bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC16</name>
              <description>semaphore 16 CPU2 interrupt clear bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC17</name>
              <description>semaphore 17 CPU2 interrupt clear bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC18</name>
              <description>semaphore 18 CPU2 interrupt clear bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC19</name>
              <description>semaphore 19 CPU2 interrupt clear bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC20</name>
              <description>semaphore 20 CPU2 interrupt clear bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC21</name>
              <description>semaphore 21 CPU2 interrupt clear bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC22</name>
              <description>semaphore 22 CPU2 interrupt clear bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC23</name>
              <description>semaphore 23 CPU2 interrupt clear bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC24</name>
              <description>semaphore 24 CPU2 interrupt clear bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC25</name>
              <description>semaphore 25 CPU2 interrupt clear bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC26</name>
              <description>semaphore 26 CPU2 interrupt clear bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC27</name>
              <description>semaphore 27 CPU2 interrupt clear bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC28</name>
              <description>semaphore 28 CPU2 interrupt clear bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC29</name>
              <description>semaphore 29 CPU2 interrupt clear bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC30</name>
              <description>semaphore 30 CPU2 interrupt clear bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISC31</name>
              <description>semaphore 31 CPU2 interrupt clear bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2ISR</name>
          <description>HSEM CPU2 interrupt status register</description>
          <addressOffset>0x118</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>ISF0</name>
              <description>semaphore 0 CPU2 interrupt status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF1</name>
              <description>semaphore 1 CPU2 interrupt status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF2</name>
              <description>semaphore 2 CPU2 interrupt status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF3</name>
              <description>semaphore 3 CPU2 interrupt status bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF4</name>
              <description>semaphore 4 CPU2 interrupt status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF5</name>
              <description>semaphore 5 CPU2 interrupt status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF6</name>
              <description>semaphore 6 CPU2 interrupt status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF7</name>
              <description>semaphore 7 CPU2 interrupt status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF8</name>
              <description>semaphore 8 CPU2 interrupt status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF9</name>
              <description>semaphore 9 CPU2 interrupt status bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF10</name>
              <description>semaphore 10 CPU2 interrupt status bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF11</name>
              <description>semaphore 11 CPU2 interrupt status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF12</name>
              <description>semaphore 12 CPU2 interrupt status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF13</name>
              <description>semaphore 13 CPU2 interrupt status bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF14</name>
              <description>semaphore 14 CPU2 interrupt status bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF15</name>
              <description>semaphore 15 CPU2 interrupt status bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF16</name>
              <description>semaphore 16 CPU2 interrupt status bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF17</name>
              <description>semaphore 17 CPU2 interrupt status bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF18</name>
              <description>semaphore 18 CPU2 interrupt status bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF19</name>
              <description>semaphore 19 CPU2 interrupt status bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF20</name>
              <description>semaphore 20 CPU2 interrupt status bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF21</name>
              <description>semaphore 21 CPU2 interrupt status bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF22</name>
              <description>semaphore 22 CPU2 interrupt status bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF23</name>
              <description>semaphore 23 CPU2 interrupt status bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF24</name>
              <description>semaphore 24 CPU2 interrupt status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF25</name>
              <description>semaphore 25 CPU2 interrupt status bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF26</name>
              <description>semaphore 26 CPU2 interrupt status bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF27</name>
              <description>semaphore 27 CPU2 interrupt status bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF28</name>
              <description>semaphore 28 CPU2 interrupt status bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF29</name>
              <description>semaphore 29 CPU2 interrupt status bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF30</name>
              <description>semaphore 30 CPU2 interrupt status bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>ISF31</name>
              <description>semaphore 31 CPU2 interrupt status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>C2MISR</name>
          <description>HSEM CPU2 masked interrupt status register</description>
          <addressOffset>0x11c</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>MISF0</name>
              <description>semaphore 0 CPU2 interrupt masked status bit</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF1</name>
              <description>semaphore 1 CPU2 interrupt masked status bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF2</name>
              <description>semaphore 2 CPU2 interrupt masked status bit</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF3</name>
              <description>semaphore 3 CPU2 interrupt masked status bit</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF4</name>
              <description>semaphore 4 CPU2 interrupt masked status bit</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF5</name>
              <description>semaphore 5 CPU2 interrupt masked status bit</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF6</name>
              <description>semaphore 6 CPU2 interrupt masked status bit</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF7</name>
              <description>semaphore 7 CPU2 interrupt masked status bit</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF8</name>
              <description>semaphore 8 CPU2 interrupt masked status bit</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF9</name>
              <description>semaphore 9 CPU2 interrupt masked status bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF10</name>
              <description>semaphore 10 CPU2 interrupt masked status bit</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF11</name>
              <description>semaphore 11 CPU2 interrupt masked status bit</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF12</name>
              <description>semaphore 12 CPU2 interrupt masked status bit</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF13</name>
              <description>semaphore 13 CPU2 interrupt masked status bit</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF14</name>
              <description>semaphore 14 CPU2 interrupt masked status bit</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF15</name>
              <description>semaphore 15 CPU2 interrupt masked status bit</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF16</name>
              <description>semaphore 16 CPU2 interrupt masked status bit</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF17</name>
              <description>semaphore 17 CPU2 interrupt masked status bit</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF18</name>
              <description>semaphore 18 CPU2 interrupt masked status bit</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF19</name>
              <description>semaphore 19 CPU2 interrupt masked status bit</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF20</name>
              <description>semaphore 20 CPU2 interrupt masked status bit</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF21</name>
              <description>semaphore 21 CPU2 interrupt masked status bit</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF22</name>
              <description>semaphore 22 CPU2 interrupt masked status bit</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF23</name>
              <description>semaphore 23 CPU2 interrupt masked status bit</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF24</name>
              <description>semaphore 24 CPU2 interrupt masked status bit</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF25</name>
              <description>semaphore 25 CPU2 interrupt masked status bit</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF26</name>
              <description>semaphore 26 CPU2 interrupt masked status bit</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF27</name>
              <description>semaphore 27 CPU2 interrupt masked status bit</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF28</name>
              <description>semaphore 28 CPU2 interrupt masked status bit</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF29</name>
              <description>semaphore 29 CPU2 interrupt masked status bit</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF30</name>
              <description>semaphore 30 CPU2 interrupt masked status bit</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
            <field>
              <name>MISF31</name>
              <description>semaphore 31 CPU2 interrupt masked status bit</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
            </field>
          </fields>
        </register>
        <register>
          <name>CR</name>
          <description>HSEM Semaphore clear register</description>
          <addressOffset>0x140</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>COREID</name>
              <description>CoreID of semaphores to be cleared</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
            </field>
            <field>
              <name>KEY</name>
              <description>semaphores clear key</description>
              <bitOffset>16</bitOffset>
              <bitWidth>16</bitWidth>
            </field>
          </fields>
        </register>
